src/InformationRegisters/ЦеныУслуг/ЦеныУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныУслуг</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </resources>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Огранизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Территории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Площадка</name>
    <type>
      <types>CatalogRef.Площадки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ряд</name>
    <type>
      <types>CatalogRef.Ряды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>CatalogRef.Места</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЦеныУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает цену услуги
Функция ЦенаУслуги(Площадка, Услуга = Неопределено, Период = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос(?(ЗначениеЗаполнено(Услуга), ТекстЗапросаЦенаУслуги(), ТекстЗапросаЦенаУслугиПлощадка()));
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Площадка", Площадка);
	Запрос.УстановитьПараметр("Услуга", Услуга);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Услуга = Выборка.Услуга;
		Возврат Выборка.Цена;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЦенаУслуги()
	
	Возврат "
	|ВЫБРАТЬ
	|	ЦеныУслугСрезПоследних.Цена КАК Цена,
	|	ЦеныУслугСрезПоследних.Услуга КАК Услуга
	|ИЗ
	|	РегистрСведений.ЦеныУслуг.СрезПоследних(&Период, Услуга = &Услуга) КАК ЦеныУслугСрезПоследних";
	
КонецФункции

Функция ТекстЗапросаЦенаУслугиПлощадка()
	
	Возврат "
	|ВЫБРАТЬ
	|	ЦеныУслугСрезПоследних.Цена КАК Цена,
	|	ЦеныУслугСрезПоследних.Услуга КАК Услуга
	|ИЗ
	|	РегистрСведений.ЦеныУслуг.СрезПоследних(&Период, Площадка = &Площадка) КАК ЦеныУслугСрезПоследних";
	
КонецФункции

#КонецОбласти

#КонецЕсли
